Revit 2027 API
FabricationNetworkChangeService.ChangeService(ISet<ElementId>, Int32, Int32) Method
 Changes the service of the selection of fabrication parts.
Namespace: Autodesk.Revit.DB.Fabrication
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FabricationNetworkChangeServiceResult ChangeService(
	ISet<ElementId> selection,
	int serviceId,
	int paletteId
)
Public Function ChangeService (
	selection As ISet(Of ElementId),
	serviceId As Integer,
	paletteId As Integer
) As FabricationNetworkChangeServiceResult
public:
FabricationNetworkChangeServiceResult ChangeService(
	ISet<ElementId^>^ selection,
	int serviceId,
	int paletteId
)
member ChangeService :
        selection : ISet<ElementId> *
        serviceId : int *
        paletteId : int -> FabricationNetworkChangeServiceResult
Parameters
selection ISet<ElementId>
 The set of element identifiers of fabrication parts to change the service for.
serviceId Int32
 The identifier of the fabrication service.
paletteId Int32
 The identifier of the fabrication palette.
Return Value
FabricationNetworkChangeServiceResult
Exceptions
Exception | Condition
ArgumentException |  The selection contains invalid elements to change.
ArgumentNullException |  A non-optional argument was null
InvalidOperationException |  No fabrication configuration is loaded.
Remarks
 After this method has been invoked, call:
GetStraightsThatWereNotChanged() to get a set of fabrication part straight element identifiers that were not changed.
GetElementsThatFailed() to get a set of fabrication part element identifiers that had failures.
See Also
Reference
FabricationNetworkChangeService Class
ChangeService Overload
Autodesk.Revit.DB.Fabrication Namespace